module {
  func.func @main(%arg0: !torch.vtensor<[16],f32>, %arg1: !torch.vtensor<[16],f32>, %arg2: !torch.vtensor<[],si64>, %arg3: !torch.vtensor<[16],f32>, %arg4: !torch.vtensor<[16],f32>, %arg5: !torch.vtensor<[],si64>, %arg6: !torch.vtensor<[16],f32>, %arg7: !torch.vtensor<[16],f32>, %arg8: !torch.vtensor<[],si64>, %arg9: !torch.vtensor<[16],f32>, %arg10: !torch.vtensor<[16],f32>, %arg11: !torch.vtensor<[],si64>, %arg12: !torch.vtensor<[16],f32>, %arg13: !torch.vtensor<[16],f32>, %arg14: !torch.vtensor<[],si64>, %arg15: !torch.vtensor<[16],f32>, %arg16: !torch.vtensor<[16],f32>, %arg17: !torch.vtensor<[],si64>, %arg18: !torch.vtensor<[16],f32>, %arg19: !torch.vtensor<[16],f32>, %arg20: !torch.vtensor<[],si64>, %arg21: !torch.vtensor<[32],f32>, %arg22: !torch.vtensor<[32],f32>, %arg23: !torch.vtensor<[],si64>, %arg24: !torch.vtensor<[32],f32>, %arg25: !torch.vtensor<[32],f32>, %arg26: !torch.vtensor<[],si64>, %arg27: !torch.vtensor<[32],f32>, %arg28: !torch.vtensor<[32],f32>, %arg29: !torch.vtensor<[],si64>, %arg30: !torch.vtensor<[32],f32>, %arg31: !torch.vtensor<[32],f32>, %arg32: !torch.vtensor<[],si64>, %arg33: !torch.vtensor<[32],f32>, %arg34: !torch.vtensor<[32],f32>, %arg35: !torch.vtensor<[],si64>, %arg36: !torch.vtensor<[32],f32>, %arg37: !torch.vtensor<[32],f32>, %arg38: !torch.vtensor<[],si64>, %arg39: !torch.vtensor<[32],f32>, %arg40: !torch.vtensor<[32],f32>, %arg41: !torch.vtensor<[],si64>, %arg42: !torch.vtensor<[64],f32>, %arg43: !torch.vtensor<[64],f32>, %arg44: !torch.vtensor<[],si64>, %arg45: !torch.vtensor<[64],f32>, %arg46: !torch.vtensor<[64],f32>, %arg47: !torch.vtensor<[],si64>, %arg48: !torch.vtensor<[64],f32>, %arg49: !torch.vtensor<[64],f32>, %arg50: !torch.vtensor<[],si64>, %arg51: !torch.vtensor<[64],f32>, %arg52: !torch.vtensor<[64],f32>, %arg53: !torch.vtensor<[],si64>, %arg54: !torch.vtensor<[64],f32>, %arg55: !torch.vtensor<[64],f32>, %arg56: !torch.vtensor<[],si64>, %arg57: !torch.vtensor<[64],f32>, %arg58: !torch.vtensor<[64],f32>, %arg59: !torch.vtensor<[],si64>, %arg60: !torch.vtensor<[64],f32>, %arg61: !torch.vtensor<[64],f32>, %arg62: !torch.vtensor<[],si64>, %arg63: !torch.vtensor<[1,3,32,32],f32>) -> (!torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[32],f32>, !torch.vtensor<[32],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[32],f32>, !torch.vtensor<[32],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[32],f32>, !torch.vtensor<[32],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[32],f32>, !torch.vtensor<[32],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[32],f32>, !torch.vtensor<[32],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[32],f32>, !torch.vtensor<[32],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[32],f32>, !torch.vtensor<[32],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[64],f32>, !torch.vtensor<[64],f32>, !torch.vtensor<[],si64>, !torch.vtensor<[1,100],f32>) {
    %int64 = torch.constant.int 64
    %int256 = torch.constant.int 256
    %int6 = torch.constant.int 6
    %float1.000000e00 = torch.constant.float 1.000000e+00
    %int1024 = torch.constant.int 1024
    %int7 = torch.constant.int 7
    %false = torch.constant.bool false
    %0 = torch.vtensor.literal(dense_resource<torch_tensor_100_torch.float32> : tensor<100xf32>) : !torch.vtensor<[100],f32>
    %1 = torch.vtensor.literal(dense_resource<torch_tensor_100_64_torch.float32> : tensor<100x64xf32>) : !torch.vtensor<[100,64],f32>
    %2 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_13> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %3 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_12> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %4 = torch.vtensor.literal(dense_resource<torch_tensor_64_64_3_3_torch.float32_4> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %5 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_11> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %6 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_10> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %7 = torch.vtensor.literal(dense_resource<torch_tensor_64_64_3_3_torch.float32_3> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %8 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_9> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %9 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_8> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %10 = torch.vtensor.literal(dense_resource<torch_tensor_64_64_3_3_torch.float32_2> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %11 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_7> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %12 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_6> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %13 = torch.vtensor.literal(dense_resource<torch_tensor_64_64_3_3_torch.float32_1> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %14 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_5> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %15 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_4> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %16 = torch.vtensor.literal(dense_resource<torch_tensor_64_32_1_1_torch.float32> : tensor<64x32x1x1xf32>) : !torch.vtensor<[64,32,1,1],f32>
    %17 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_3> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %18 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_2> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %19 = torch.vtensor.literal(dense_resource<torch_tensor_64_64_3_3_torch.float32> : tensor<64x64x3x3xf32>) : !torch.vtensor<[64,64,3,3],f32>
    %20 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32_1> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %21 = torch.vtensor.literal(dense_resource<torch_tensor_64_torch.float32> : tensor<64xf32>) : !torch.vtensor<[64],f32>
    %float1.015870e00 = torch.constant.float 1.0158730158730158
    %22 = torch.vtensor.literal(dense_resource<torch_tensor_64_32_3_3_torch.float32> : tensor<64x32x3x3xf32>) : !torch.vtensor<[64,32,3,3],f32>
    %23 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_13> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %24 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_12> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %25 = torch.vtensor.literal(dense_resource<torch_tensor_32_32_3_3_torch.float32_4> : tensor<32x32x3x3xf32>) : !torch.vtensor<[32,32,3,3],f32>
    %26 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_11> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %27 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_10> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %28 = torch.vtensor.literal(dense_resource<torch_tensor_32_32_3_3_torch.float32_3> : tensor<32x32x3x3xf32>) : !torch.vtensor<[32,32,3,3],f32>
    %29 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_9> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %30 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_8> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %31 = torch.vtensor.literal(dense_resource<torch_tensor_32_32_3_3_torch.float32_2> : tensor<32x32x3x3xf32>) : !torch.vtensor<[32,32,3,3],f32>
    %32 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_7> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %33 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_6> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %34 = torch.vtensor.literal(dense_resource<torch_tensor_32_32_3_3_torch.float32_1> : tensor<32x32x3x3xf32>) : !torch.vtensor<[32,32,3,3],f32>
    %35 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_5> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %36 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_4> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %37 = torch.vtensor.literal(dense_resource<torch_tensor_32_16_1_1_torch.float32> : tensor<32x16x1x1xf32>) : !torch.vtensor<[32,16,1,1],f32>
    %38 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_3> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %39 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_2> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %40 = torch.vtensor.literal(dense_resource<torch_tensor_32_32_3_3_torch.float32> : tensor<32x32x3x3xf32>) : !torch.vtensor<[32,32,3,3],f32>
    %41 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32_1> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %42 = torch.vtensor.literal(dense_resource<torch_tensor_32_torch.float32> : tensor<32xf32>) : !torch.vtensor<[32],f32>
    %float1.003920e00 = torch.constant.float 1.003921568627451
    %43 = torch.vtensor.literal(dense_resource<torch_tensor_32_16_3_3_torch.float32> : tensor<32x16x3x3xf32>) : !torch.vtensor<[32,16,3,3],f32>
    %44 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_13> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %45 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_12> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %46 = torch.vtensor.literal(dense_resource<torch_tensor_16_16_3_3_torch.float32_5> : tensor<16x16x3x3xf32>) : !torch.vtensor<[16,16,3,3],f32>
    %47 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_11> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %48 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_10> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %49 = torch.vtensor.literal(dense_resource<torch_tensor_16_16_3_3_torch.float32_4> : tensor<16x16x3x3xf32>) : !torch.vtensor<[16,16,3,3],f32>
    %50 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_9> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %51 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_8> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %52 = torch.vtensor.literal(dense_resource<torch_tensor_16_16_3_3_torch.float32_3> : tensor<16x16x3x3xf32>) : !torch.vtensor<[16,16,3,3],f32>
    %53 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_7> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %54 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_6> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %55 = torch.vtensor.literal(dense_resource<torch_tensor_16_16_3_3_torch.float32_2> : tensor<16x16x3x3xf32>) : !torch.vtensor<[16,16,3,3],f32>
    %56 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_5> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %57 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_4> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %58 = torch.vtensor.literal(dense_resource<torch_tensor_16_16_3_3_torch.float32_1> : tensor<16x16x3x3xf32>) : !torch.vtensor<[16,16,3,3],f32>
    %59 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_3> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %60 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_2> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %61 = torch.vtensor.literal(dense_resource<torch_tensor_16_16_3_3_torch.float32> : tensor<16x16x3x3xf32>) : !torch.vtensor<[16,16,3,3],f32>
    %float5.000000e-01 = torch.constant.float 5.000000e-01
    %int8 = torch.constant.int 8
    %62 = torch.vtensor.literal(dense<8.000000e+00> : tensor<1xf32>) : !torch.vtensor<[1],f32>
    %63 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32_1> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %int-1 = torch.constant.int -1
    %64 = torch.vtensor.literal(dense_resource<torch_tensor_16_torch.float32> : tensor<16xf32>) : !torch.vtensor<[16],f32>
    %float1.000980e00 = torch.constant.float 1.0009775171065494
    %float9.000000e-01 = torch.constant.float 9.000000e-01
    %float1.000000e-01 = torch.constant.float 1.000000e-01
    %float1.000000e-05 = torch.constant.float 1.000000e-05
    %true = torch.constant.bool true
    %int3 = torch.constant.int 3
    %int2 = torch.constant.int 2
    %int0 = torch.constant.int 0
    %65 = torch.vtensor.literal(dense_resource<torch_tensor_16_3_3_3_torch.float32> : tensor<16x3x3x3xf32>) : !torch.vtensor<[16,3,3,3],f32>
    %none = torch.constant.none
    %int1 = torch.constant.int 1
    %66 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %67 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %68 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %69 = torch.prim.ListConstruct  : () -> !torch.list<int>
    %70 = torch.aten.convolution %arg63, %65, %none, %66, %67, %68, %false, %69, %int1 : !torch.vtensor<[1,3,32,32],f32>, !torch.vtensor<[16,3,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %71 = torch.aten.add.Scalar %arg2, %int1, %int1 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %72 = torch.prim.ListConstruct %int0, %int2, %int3 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %73 = torch.aten.to.dtype %70, %int7, %false, %false, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,32,32],f64>
    %74 = torch.aten.sum.dim_IntList %73, %72, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %75 = torch.aten.div.Scalar %74, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %76 = torch.aten.sub.Tensor %73, %75, %float1.000000e00 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,1,1],f64>, !torch.float -> !torch.vtensor<[1,16,32,32],f64>
    %77 = torch.aten.mul.Tensor %76, %76 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,32,32],f64> -> !torch.vtensor<[1,16,32,32],f64>
    %78 = torch.aten.sum.dim_IntList %77, %72, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %79 = torch.aten.div.Scalar %78, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %80 = torch.aten.to.dtype %79, %int6, %false, %false, %none : !torch.vtensor<[1,16,1,1],f64>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %81 = torch.aten.sum.dim_IntList %70, %72, %true, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %82 = torch.aten.div.Scalar %81, %int1024 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %83 = torch.aten.add.Scalar %80, %float1.000000e-05, %int1 : !torch.vtensor<[1,16,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %84 = torch.aten.rsqrt %83 : !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,1,1],f32>
    %85 = torch.aten.sub.Tensor %70, %82, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %86 = torch.aten.mul.Tensor %85, %84 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %87 = torch.aten.squeeze.dim %82, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %88 = torch.aten.squeeze.dim %87, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %89 = torch.aten.squeeze.dim %88, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %90 = torch.aten.mul.Scalar %89, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %91 = torch.aten.mul.Scalar %arg0, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %92 = torch.aten.add.Tensor %90, %91, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %93 = torch.aten.squeeze.dim %80, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %94 = torch.aten.squeeze.dim %93, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %95 = torch.aten.squeeze.dim %94, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %96 = torch.aten.mul.Scalar %95, %float1.000980e00 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %97 = torch.aten.mul.Scalar %96, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %98 = torch.aten.mul.Scalar %arg1, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %99 = torch.aten.add.Tensor %97, %98, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %100 = torch.aten.unsqueeze %64, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %101 = torch.aten.unsqueeze %100, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %102 = torch.aten.mul.Tensor %86, %101 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %103 = torch.aten.unsqueeze %63, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %104 = torch.aten.unsqueeze %103, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %105 = torch.aten.add.Tensor %102, %104, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %106 = torch.aten.div.Tensor %105, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %107 = torch.aten.clamp %106, %int0, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %108 = torch.aten.mul.Scalar %107, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %109 = torch.aten.add.Scalar %108, %float5.000000e-01, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %110 = torch.aten.floor %109 : !torch.vtensor<[1,16,32,32],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %111 = torch.aten.div.Scalar %110, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %112 = torch.aten.mul.Tensor %111, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %113 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %114 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %115 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %116 = torch.prim.ListConstruct  : () -> !torch.list<int>
    %117 = torch.aten.convolution %112, %61, %none, %113, %114, %115, %false, %116, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,16,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %118 = torch.aten.add.Scalar %arg5, %int1, %int1 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %119 = torch.prim.ListConstruct %int0, %int2, %int3 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %120 = torch.aten.to.dtype %117, %int7, %false, %false, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,32,32],f64>
    %121 = torch.aten.sum.dim_IntList %120, %119, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %122 = torch.aten.div.Scalar %121, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %123 = torch.aten.sub.Tensor %120, %122, %float1.000000e00 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,1,1],f64>, !torch.float -> !torch.vtensor<[1,16,32,32],f64>
    %124 = torch.aten.mul.Tensor %123, %123 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,32,32],f64> -> !torch.vtensor<[1,16,32,32],f64>
    %125 = torch.aten.sum.dim_IntList %124, %119, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %126 = torch.aten.div.Scalar %125, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %127 = torch.aten.to.dtype %126, %int6, %false, %false, %none : !torch.vtensor<[1,16,1,1],f64>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %128 = torch.aten.sum.dim_IntList %117, %119, %true, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %129 = torch.aten.div.Scalar %128, %int1024 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %130 = torch.aten.add.Scalar %127, %float1.000000e-05, %int1 : !torch.vtensor<[1,16,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %131 = torch.aten.rsqrt %130 : !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,1,1],f32>
    %132 = torch.aten.sub.Tensor %117, %129, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %133 = torch.aten.mul.Tensor %132, %131 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %134 = torch.aten.squeeze.dim %129, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %135 = torch.aten.squeeze.dim %134, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %136 = torch.aten.squeeze.dim %135, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %137 = torch.aten.mul.Scalar %136, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %138 = torch.aten.mul.Scalar %arg3, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %139 = torch.aten.add.Tensor %137, %138, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %140 = torch.aten.squeeze.dim %127, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %141 = torch.aten.squeeze.dim %140, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %142 = torch.aten.squeeze.dim %141, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %143 = torch.aten.mul.Scalar %142, %float1.000980e00 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %144 = torch.aten.mul.Scalar %143, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %145 = torch.aten.mul.Scalar %arg4, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %146 = torch.aten.add.Tensor %144, %145, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %147 = torch.aten.unsqueeze %60, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %148 = torch.aten.unsqueeze %147, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %149 = torch.aten.mul.Tensor %133, %148 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %150 = torch.aten.unsqueeze %59, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %151 = torch.aten.unsqueeze %150, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %152 = torch.aten.add.Tensor %149, %151, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %153 = torch.aten.div.Tensor %152, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %154 = torch.aten.clamp %153, %int0, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %155 = torch.aten.mul.Scalar %154, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %156 = torch.aten.add.Scalar %155, %float5.000000e-01, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %157 = torch.aten.floor %156 : !torch.vtensor<[1,16,32,32],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %158 = torch.aten.div.Scalar %157, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %159 = torch.aten.mul.Tensor %158, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %160 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %161 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %162 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %163 = torch.prim.ListConstruct  : () -> !torch.list<int>
    %164 = torch.aten.convolution %159, %58, %none, %160, %161, %162, %false, %163, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,16,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %165 = torch.aten.add.Scalar %arg8, %int1, %int1 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %166 = torch.prim.ListConstruct %int0, %int2, %int3 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %167 = torch.aten.to.dtype %164, %int7, %false, %false, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,32,32],f64>
    %168 = torch.aten.sum.dim_IntList %167, %166, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %169 = torch.aten.div.Scalar %168, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %170 = torch.aten.sub.Tensor %167, %169, %float1.000000e00 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,1,1],f64>, !torch.float -> !torch.vtensor<[1,16,32,32],f64>
    %171 = torch.aten.mul.Tensor %170, %170 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,32,32],f64> -> !torch.vtensor<[1,16,32,32],f64>
    %172 = torch.aten.sum.dim_IntList %171, %166, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %173 = torch.aten.div.Scalar %172, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %174 = torch.aten.to.dtype %173, %int6, %false, %false, %none : !torch.vtensor<[1,16,1,1],f64>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %175 = torch.aten.sum.dim_IntList %164, %166, %true, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %176 = torch.aten.div.Scalar %175, %int1024 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %177 = torch.aten.add.Scalar %174, %float1.000000e-05, %int1 : !torch.vtensor<[1,16,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %178 = torch.aten.rsqrt %177 : !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,1,1],f32>
    %179 = torch.aten.sub.Tensor %164, %176, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %180 = torch.aten.mul.Tensor %179, %178 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %181 = torch.aten.squeeze.dim %176, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %182 = torch.aten.squeeze.dim %181, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %183 = torch.aten.squeeze.dim %182, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %184 = torch.aten.mul.Scalar %183, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %185 = torch.aten.mul.Scalar %arg6, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %186 = torch.aten.add.Tensor %184, %185, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %187 = torch.aten.squeeze.dim %174, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %188 = torch.aten.squeeze.dim %187, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %189 = torch.aten.squeeze.dim %188, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %190 = torch.aten.mul.Scalar %189, %float1.000980e00 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %191 = torch.aten.mul.Scalar %190, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %192 = torch.aten.mul.Scalar %arg7, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %193 = torch.aten.add.Tensor %191, %192, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %194 = torch.aten.unsqueeze %57, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %195 = torch.aten.unsqueeze %194, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %196 = torch.aten.mul.Tensor %180, %195 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %197 = torch.aten.unsqueeze %56, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %198 = torch.aten.unsqueeze %197, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %199 = torch.aten.add.Tensor %196, %198, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %200 = torch.aten.add.Tensor %199, %112, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %201 = torch.aten.div.Tensor %200, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %202 = torch.aten.clamp %201, %int0, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %203 = torch.aten.mul.Scalar %202, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %204 = torch.aten.add.Scalar %203, %float5.000000e-01, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %205 = torch.aten.floor %204 : !torch.vtensor<[1,16,32,32],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %206 = torch.aten.div.Scalar %205, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %207 = torch.aten.mul.Tensor %206, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %208 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %209 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %210 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %211 = torch.prim.ListConstruct  : () -> !torch.list<int>
    %212 = torch.aten.convolution %207, %55, %none, %208, %209, %210, %false, %211, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,16,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %213 = torch.aten.add.Scalar %arg11, %int1, %int1 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %214 = torch.prim.ListConstruct %int0, %int2, %int3 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %215 = torch.aten.to.dtype %212, %int7, %false, %false, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,32,32],f64>
    %216 = torch.aten.sum.dim_IntList %215, %214, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %217 = torch.aten.div.Scalar %216, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %218 = torch.aten.sub.Tensor %215, %217, %float1.000000e00 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,1,1],f64>, !torch.float -> !torch.vtensor<[1,16,32,32],f64>
    %219 = torch.aten.mul.Tensor %218, %218 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,32,32],f64> -> !torch.vtensor<[1,16,32,32],f64>
    %220 = torch.aten.sum.dim_IntList %219, %214, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %221 = torch.aten.div.Scalar %220, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %222 = torch.aten.to.dtype %221, %int6, %false, %false, %none : !torch.vtensor<[1,16,1,1],f64>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %223 = torch.aten.sum.dim_IntList %212, %214, %true, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %224 = torch.aten.div.Scalar %223, %int1024 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %225 = torch.aten.add.Scalar %222, %float1.000000e-05, %int1 : !torch.vtensor<[1,16,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %226 = torch.aten.rsqrt %225 : !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,1,1],f32>
    %227 = torch.aten.sub.Tensor %212, %224, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %228 = torch.aten.mul.Tensor %227, %226 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %229 = torch.aten.squeeze.dim %224, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %230 = torch.aten.squeeze.dim %229, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %231 = torch.aten.squeeze.dim %230, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %232 = torch.aten.mul.Scalar %231, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %233 = torch.aten.mul.Scalar %arg9, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %234 = torch.aten.add.Tensor %232, %233, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %235 = torch.aten.squeeze.dim %222, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %236 = torch.aten.squeeze.dim %235, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %237 = torch.aten.squeeze.dim %236, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %238 = torch.aten.mul.Scalar %237, %float1.000980e00 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %239 = torch.aten.mul.Scalar %238, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %240 = torch.aten.mul.Scalar %arg10, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %241 = torch.aten.add.Tensor %239, %240, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %242 = torch.aten.unsqueeze %54, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %243 = torch.aten.unsqueeze %242, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %244 = torch.aten.mul.Tensor %228, %243 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %245 = torch.aten.unsqueeze %53, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %246 = torch.aten.unsqueeze %245, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %247 = torch.aten.add.Tensor %244, %246, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %248 = torch.aten.div.Tensor %247, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %249 = torch.aten.clamp %248, %int0, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %250 = torch.aten.mul.Scalar %249, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %251 = torch.aten.add.Scalar %250, %float5.000000e-01, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %252 = torch.aten.floor %251 : !torch.vtensor<[1,16,32,32],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %253 = torch.aten.div.Scalar %252, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %254 = torch.aten.mul.Tensor %253, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %255 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %256 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %257 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %258 = torch.prim.ListConstruct  : () -> !torch.list<int>
    %259 = torch.aten.convolution %254, %52, %none, %255, %256, %257, %false, %258, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,16,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %260 = torch.aten.add.Scalar %arg14, %int1, %int1 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %261 = torch.prim.ListConstruct %int0, %int2, %int3 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %262 = torch.aten.to.dtype %259, %int7, %false, %false, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,32,32],f64>
    %263 = torch.aten.sum.dim_IntList %262, %261, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %264 = torch.aten.div.Scalar %263, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %265 = torch.aten.sub.Tensor %262, %264, %float1.000000e00 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,1,1],f64>, !torch.float -> !torch.vtensor<[1,16,32,32],f64>
    %266 = torch.aten.mul.Tensor %265, %265 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,32,32],f64> -> !torch.vtensor<[1,16,32,32],f64>
    %267 = torch.aten.sum.dim_IntList %266, %261, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %268 = torch.aten.div.Scalar %267, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %269 = torch.aten.to.dtype %268, %int6, %false, %false, %none : !torch.vtensor<[1,16,1,1],f64>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %270 = torch.aten.sum.dim_IntList %259, %261, %true, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %271 = torch.aten.div.Scalar %270, %int1024 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %272 = torch.aten.add.Scalar %269, %float1.000000e-05, %int1 : !torch.vtensor<[1,16,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %273 = torch.aten.rsqrt %272 : !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,1,1],f32>
    %274 = torch.aten.sub.Tensor %259, %271, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %275 = torch.aten.mul.Tensor %274, %273 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %276 = torch.aten.squeeze.dim %271, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %277 = torch.aten.squeeze.dim %276, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %278 = torch.aten.squeeze.dim %277, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %279 = torch.aten.mul.Scalar %278, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %280 = torch.aten.mul.Scalar %arg12, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %281 = torch.aten.add.Tensor %279, %280, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %282 = torch.aten.squeeze.dim %269, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %283 = torch.aten.squeeze.dim %282, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %284 = torch.aten.squeeze.dim %283, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %285 = torch.aten.mul.Scalar %284, %float1.000980e00 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %286 = torch.aten.mul.Scalar %285, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %287 = torch.aten.mul.Scalar %arg13, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %288 = torch.aten.add.Tensor %286, %287, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %289 = torch.aten.unsqueeze %51, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %290 = torch.aten.unsqueeze %289, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %291 = torch.aten.mul.Tensor %275, %290 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %292 = torch.aten.unsqueeze %50, %int-1 : !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16,1],f32>
    %293 = torch.aten.unsqueeze %292, %int-1 : !torch.vtensor<[16,1],f32>, !torch.int -> !torch.vtensor<[16,1,1],f32>
    %294 = torch.aten.add.Tensor %291, %293, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %295 = torch.aten.add.Tensor %294, %207, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %296 = torch.aten.div.Tensor %295, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %297 = torch.aten.clamp %296, %int0, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %298 = torch.aten.mul.Scalar %297, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %299 = torch.aten.add.Scalar %298, %float5.000000e-01, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %300 = torch.aten.floor %299 : !torch.vtensor<[1,16,32,32],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %301 = torch.aten.div.Scalar %300, %int8 : !torch.vtensor<[1,16,32,32],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %302 = torch.aten.mul.Tensor %301, %62 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %303 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %304 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %305 = torch.prim.ListConstruct %int1, %int1 : (!torch.int, !torch.int) -> !torch.list<int>
    %306 = torch.prim.ListConstruct  : () -> !torch.list<int>
    %307 = torch.aten.convolution %302, %49, %none, %303, %304, %305, %false, %306, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[16,16,3,3],f32>, !torch.none, !torch.list<int>, !torch.list<int>, !torch.list<int>, !torch.bool, !torch.list<int>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %308 = torch.aten.add.Scalar %arg17, %int1, %int1 : !torch.vtensor<[],si64>, !torch.int, !torch.int -> !torch.vtensor<[],si64>
    %309 = torch.prim.ListConstruct %int0, %int2, %int3 : (!torch.int, !torch.int, !torch.int) -> !torch.list<int>
    %310 = torch.aten.to.dtype %307, %int7, %false, %false, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,32,32],f64>
    %311 = torch.aten.sum.dim_IntList %310, %309, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %312 = torch.aten.div.Scalar %311, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %313 = torch.aten.sub.Tensor %310, %312, %float1.000000e00 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,1,1],f64>, !torch.float -> !torch.vtensor<[1,16,32,32],f64>
    %314 = torch.aten.mul.Tensor %313, %313 : !torch.vtensor<[1,16,32,32],f64>, !torch.vtensor<[1,16,32,32],f64> -> !torch.vtensor<[1,16,32,32],f64>
    %315 = torch.aten.sum.dim_IntList %314, %309, %true, %none : !torch.vtensor<[1,16,32,32],f64>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f64>
    %316 = torch.aten.div.Scalar %315, %int1024 : !torch.vtensor<[1,16,1,1],f64>, !torch.int -> !torch.vtensor<[1,16,1,1],f64>
    %317 = torch.aten.to.dtype %316, %int6, %false, %false, %none : !torch.vtensor<[1,16,1,1],f64>, !torch.int, !torch.bool, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %318 = torch.aten.sum.dim_IntList %307, %309, %true, %none : !torch.vtensor<[1,16,32,32],f32>, !torch.list<int>, !torch.bool, !torch.none -> !torch.vtensor<[1,16,1,1],f32>
    %319 = torch.aten.div.Scalar %318, %int1024 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %320 = torch.aten.add.Scalar %317, %float1.000000e-05, %int1 : !torch.vtensor<[1,16,1,1],f32>, !torch.float, !torch.int -> !torch.vtensor<[1,16,1,1],f32>
    %321 = torch.aten.rsqrt %320 : !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,1,1],f32>
    %322 = torch.aten.sub.Tensor %307, %319, %int1 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,32,32],f32>
    %323 = torch.aten.mul.Tensor %322, %321 : !torch.vtensor<[1,16,32,32],f32>, !torch.vtensor<[1,16,1,1],f32> -> !torch.vtensor<[1,16,32,32],f32>
    %324 = torch.aten.squeeze.dim %319, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %325 = torch.aten.squeeze.dim %324, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
    %326 = torch.aten.squeeze.dim %325, %int0 : !torch.vtensor<[1,16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %327 = torch.aten.mul.Scalar %326, %float1.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %328 = torch.aten.mul.Scalar %arg15, %float9.000000e-01 : !torch.vtensor<[16],f32>, !torch.float -> !torch.vtensor<[16],f32>
    %329 = torch.aten.add.Tensor %327, %328, %int1 : !torch.vtensor<[16],f32>, !torch.vtensor<[16],f32>, !torch.int -> !torch.vtensor<[16],f32>
    %330 = torch.aten.squeeze.dim %317, %int3 : !torch.vtensor<[1,16,1,1],f32>, !torch.int -> !torch.vtensor<[1,16,1],f32>
    %331 = torch.aten.squeeze.dim %330, %int2 : !torch.vtensor<[1,16,1],f32>, !torch.int -> !torch.vtensor<[1,16],f32>
